- 색인이 다른 객체를 더하는 산술 연산

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [3]:
s1 = Series([5, 6, -1, 2], index = ['a', 'c', 'd', 'e'])
s2 = Series([3, 4, -1, 2, 7], index = ['a', 'c', 'e', 'f', 'g'])

s1 + s2

a     8.0
c    10.0
d     NaN
e     1.0
f     NaN
g     NaN
dtype: float64

In [5]:
df1 = DataFrame(np.arange(9).reshape(3,3), 
                columns = list('bcd'),
                index = ['Seoul', 'Busan', 'Kwangju'])
df2 = DataFrame(np.arange(12).reshape(4,3),
                columns = list('bde'),
                index = ['incheon', 'Seoul', 'Busan', 'Suwon'])
df1 + df2

           b   c     d   e
Busan    9.0 NaN  12.0 NaN
Kwangju  NaN NaN   NaN NaN
Seoul    3.0 NaN   6.0 NaN
Suwon    NaN NaN   NaN NaN
incheon  NaN NaN   NaN NaN

In [6]:
df3 = DataFrame(np.arange(12).reshape(3,4), columns = list('abcd'))
df4 = DataFrame(np.arange(20).reshape(4,5), columns = list('abcde'))

print(df3)
print(df4)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [7]:
df3 + df4

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [8]:
df3.add(df4, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [11]:
df3.reindex(columns=df4.columns, fill_value = 0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0